numbers_to_string_dictionary = {
    # ---------- единицы ----------
    0: "ноль",
    1: "один",
    2: "два",
    3: "три",
    4: "четыре",
    5: "пять",
    6: "шесть",
    7: "семь",
    8: "восемь",
    9: "девять",

    # ---------- 10–19 ----------
    10: "десять",
    11: "одиннадцать",
    12: "двенадцать",
    13: "тринадцать",
    14: "четырнадцать",
    15: "пятнадцать",
    16: "шестнадцать",
    17: "семнадцать",
    18: "восемнадцать",
    19: "девятнадцать",

    # ---------- десятки ----------
    20: "двадцать",
    30: "тридцать",
    40: "сорок",
    50: "пятьдесят",
    60: "шестьдесят",
    70: "семьдесят",
    80: "восемьдесят",
    90: "девяносто",

    # ---------- сотни -----------

    100: "сто",
    200: "двести",
    300: "триста",
    400: "четыреста",
    500: "пятьсот",
    600: "шестьсот",
    700: "семьсот",
    800: "восемьсот",
    900: "девятьсот"
}

def to_words_format(answer):
    answer = str(answer)
    phrase_parts = []
    start = 0
    if answer[0] == "-":
        phrase_parts.append("минус")
        start += 1
    for symbol_idx in range(start, len(answer)):
        temp = int(answer[symbol_idx]) * 10 ** (len(answer)-symbol_idx - 1)
        phrase_parts.append(numbers_to_string_dictionary[temp])

    return " ".join(phrase_parts)